class Urls:
    PAGE_MAIN = 'https://qa-scooter.praktikum-services.ru/' # Главная страница "Яндекс самоката"
    PAGE_ORDER = f"{PAGE_MAIN}order" # Страница заказа "Яндекс самоката"
    PAGE_DZEN = 'https://dzen.ru/?yredirect=true' # Страница "Дзен"

class User_1:
        f_name = "Виктор"
        l_name = "Иванов"
        adr = "Ленина 16"
        ms = "ВДНХ"
        tel = "+79994995146"
        del_data = '14.07.2026'
        period = 'сутки'
        sc_color = ''
        msg = "Не звонить!"

class User_2:
        f_name = "Анна"
        l_name = "Котова"
        adr = "Свободы 15"
        ms = "Черкизовская"
        tel = "88002509639"
        del_data = '12.07.2026'
        period = 'двое суток'
        sc_color = ''
        msg = "Привезите в срок"

FAQ_ANS = [
    "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
    "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
    "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
    "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
    "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
    "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
    "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
    "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    ]